In [6]:
import numpy as np
import pandas as pd

In [7]:
dict1 = {
    "name":['priyanshu','rohan','sohan','skillf'],
    "marks":[92, 34, 44, 54],
    "city":['lucknow','delhi','kanpur','bareilly']
}

In [8]:
df = pd.DataFrame(dict1)

In [9]:
df

        name  marks      city
0  priyanshu     92   lucknow
1      rohan     34     delhi
2      sohan     44    kanpur
3     skillf     54  bareilly

In [10]:
df.to_csv('friends.csv')

In [11]:
df.to_csv('friends_indexfalse.csv', index = False)

In [12]:
df.head(2)

        name  marks     city
0  priyanshu     92  lucknow
1      rohan     34    delhi

In [13]:
df.tail(3)

     name  marks      city
1   rohan     34     delhi
2   sohan     44    kanpur
3  skillf     54  bareilly

In [14]:
df.describe()

           marks
count   4.000000
mean   56.000000
std    25.350871
min    34.000000
25%    41.500000
50%    49.000000
75%    63.500000
max    92.000000

In [15]:
df.describe(include='all')

             name      marks     city
count           4   4.000000        4
unique          4        NaN        4
top     priyanshu        NaN  lucknow
freq            1        NaN        1
mean          NaN  56.000000      NaN
std           NaN  25.350871      NaN
min           NaN  34.000000      NaN
25%           NaN  41.500000      NaN
50%           NaN  49.000000      NaN
75%           NaN  63.500000      NaN
max           NaN  92.000000      NaN

In [16]:
priyanshu = pd.read_csv('priyanshu.csv')

In [17]:
priyanshu

   train_no  speed             city
0     12344    125          lucknow
1     23444    344            delhi
2     23322    133  Gola Gokarnnath
3      2345    435          chennai

In [18]:
priyanshu.head(3)

   train_no  speed             city
0     12344    125          lucknow
1     23444    344            delhi
2     23322    133  Gola Gokarnnath

In [19]:
priyanshu.tail(2)

   train_no  speed             city
2     23322    133  Gola Gokarnnath
3      2345    435          chennai

In [20]:
priyanshu.describe()

           train_no       speed
count      4.000000    4.000000
mean   15363.750000  259.250000
std    10119.797836  154.954563
min     2345.000000  125.000000
25%     9844.250000  131.000000
50%    17833.000000  238.500000
75%    23352.500000  366.750000
max    23444.000000  435.000000

In [21]:
priyanshu.describe(include='all')

            train_no       speed     city
count       4.000000    4.000000        4
unique           NaN         NaN        4
top              NaN         NaN  lucknow
freq             NaN         NaN        1
mean    15363.750000  259.250000      NaN
std     10119.797836  154.954563      NaN
min      2345.000000  125.000000      NaN
25%      9844.250000  131.000000      NaN
50%     17833.000000  238.500000      NaN
75%     23352.500000  366.750000      NaN
max     23444.000000  435.000000      NaN

In [22]:
priyanshu['speed'][0]= 125

C:\Users\verma\AppData\Local\Temp\ipykernel_8896\2568459189.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  priyanshu['speed'][0]= 125
C:\Users\verma\AppData\Local\Temp\ipykernel_8896\2568459189.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  priyanshu['speed'][0]= 125

In [23]:
priyanshu

   train_no  speed             city
0     12344    125          lucknow
1     23444    344            delhi
2     23322    133  Gola Gokarnnath
3      2345    435          chennai

In [24]:
priyanshu.to_csv("priyanshu.csv",index = False)

In [25]:
priyanshu['city'][2] = "Gola Gokarnnath"

C:\Users\verma\AppData\Local\Temp\ipykernel_8896\1859741309.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  priyanshu['city'][2] = "Gola Gokarnnath"
C:\Users\verma\AppData\Local\Temp\ipykernel_8896\1859741309.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  priyanshu['city'][2] = "Gola Gokarnnath"

In [26]:
priyanshu

   train_no  speed             city
0     12344    125          lucknow
1     23444    344            delhi
2     23322    133  Gola Gokarnnath
3      2345    435          chennai

In [27]:
priyanshu.to_csv("priyanshu.csv",index = False)

In [28]:
priyanshu

   train_no  speed             city
0     12344    125          lucknow
1     23444    344            delhi
2     23322    133  Gola Gokarnnath
3      2345    435          chennai

In [29]:
priyanshu.index = ['first', 'second','third','fourth']

In [30]:
priyanshu

        train_no  speed             city
first      12344    125          lucknow
second     23444    344            delhi
third      23322    133  Gola Gokarnnath
fourth      2345    435          chennai

In [31]:
ser = pd.Series(np.random.rand(22))

In [32]:
type(ser)

pandas.core.series.Series

In [33]:
newdf = pd.DataFrame(np.random.rand(334,5), index = np.arange(334))

In [34]:
type(newdf)
newdf.head()

          0         1         2         3         4
0  0.753924  0.337627  0.494060  0.523363  0.232386
1  0.366412  0.289398  0.522661  0.556647  0.636581
2  0.412449  0.007735  0.421826  0.419752  0.976503
3  0.792950  0.933153  0.654433  0.225260  0.709102
4  0.141460  0.703867  0.907866  0.619688  0.085312

In [35]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [36]:
newdf[0][0] = "priyanshu"

C:\Users\verma\AppData\Local\Temp\ipykernel_8896\475059861.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0] = "priyanshu"
C:\Users\verma\AppData\Local\Temp\ipykernel_8896\475059861.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'priyanshu' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0] = "priyanshu"

In [37]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [38]:
newdf.head()

           0         1         2         3         4
0  priyanshu  0.337627  0.494060  0.523363  0.232386
1   0.366412  0.289398  0.522661  0.556647  0.636581
2   0.412449  0.007735  0.421826  0.419752  0.976503
3    0.79295  0.933153  0.654433  0.225260  0.709102
4    0.14146  0.703867  0.907866  0.619688  0.085312

In [39]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [40]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [41]:
newdf.to_numpy()

array([['priyanshu', 0.33762747950804206, 0.4940602459085657,
        0.5233629653176148, 0.23238605933843437],
       [0.3664124405230704, 0.289397841828694, 0.5226609369017181,
        0.5566467166755429, 0.6365812430594839],
       [0.41244934308685166, 0.007734693863521436, 0.42182599873131477,
        0.41975165827252336, 0.9765027823642877],
       ...,
       [0.1553496511546767, 0.17805102436605502, 0.43245454773373027,
        0.07557455866611706, 0.7401790526202477],
       [0.5544335889590476, 0.5633233073274491, 0.5238357852773656,
        0.015185700821977899, 0.08802593536723968],
       [0.5660764136815818, 0.28630840104467836, 0.38783873315831485,
        0.8216119143284614, 0.937602782340891]], dtype=object)

In [42]:
newdf[0][0] = 0.34356

In [43]:
newdf[3][2] = 0.2244

C:\Users\verma\AppData\Local\Temp\ipykernel_8896\343592338.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[3][2] = 0.2244
C:\Users\verma\AppData\Local\Temp\ipykernel_8896\343592338.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf[3][2] = 0.2244

In [44]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [45]:
newdf

            0         1         2         3         4
0     0.34356  0.337627  0.494060  0.523363  0.232386
1    0.366412  0.289398  0.522661  0.556647  0.636581
2    0.412449  0.007735  0.421826  0.224400  0.976503
3     0.79295  0.933153  0.654433  0.225260  0.709102
4     0.14146  0.703867  0.907866  0.619688  0.085312
..        ...       ...       ...       ...       ...
329  0.330602  0.255965  0.006253  0.731445  0.551473
330   0.09004  0.234745  0.112143  0.207764  0.021992
331   0.15535  0.178051  0.432455  0.075575  0.740179
332  0.554434  0.563323  0.523836  0.015186  0.088026
333  0.566076  0.286308  0.387839  0.821612  0.937603

[334 rows x 5 columns]

In [46]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.34356,0.366412,0.412449,0.79295,0.14146,0.542512,0.238015,0.597539,0.124204,0.451459,...,0.852975,0.435633,0.160713,0.027743,0.804812,0.330602,0.09004,0.15535,0.554434,0.566076
1,0.337627,0.289398,0.007735,0.933153,0.703867,0.188565,0.081495,0.080053,0.32136,0.329974,...,0.183424,0.404425,0.192096,0.231387,0.929651,0.255965,0.234745,0.178051,0.563323,0.286308
2,0.49406,0.522661,0.421826,0.654433,0.907866,0.834269,0.257601,0.635889,0.161654,0.235152,...,0.698652,0.192099,0.041061,0.457389,0.327195,0.006253,0.112143,0.432455,0.523836,0.387839
3,0.523363,0.556647,0.2244,0.22526,0.619688,0.282443,0.056856,0.152941,0.239674,0.484919,...,0.477861,0.531947,0.283129,0.670768,0.749465,0.731445,0.207764,0.075575,0.015186,0.821612
4,0.232386,0.636581,0.976503,0.709102,0.085312,0.144547,0.474415,0.255333,0.722726,0.823725,...,0.009124,0.99102,0.12425,0.586051,0.864294,0.551473,0.021992,0.740179,0.088026,0.937603